{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Угадай число\n",
    "Нужно написать программу, которая угадывает число за минимальное число попыток.\n",
    "\n",
    "## Условия соревнования\n",
    "- Компьютер загадывает целое число от 1 до 100, затем угадывает его.\n",
    "- Алгоритм учитывает информацию о том, больше ли случайное число или меньше нужного нам.\n",
    "- Необходимо добиться того, чтобы программа угадывала число меньше, чем за 20 попыток. \n",
    "\n",
    "## Разработка\n",
    "В процессе разработки было написано 3 различных алгоритма:\n",
    "- Алгоритм modified_predict\n",
    "- Алгоритм mean_predict\n",
    "- Алгоритм random_predict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "\n",
    "test_number=1 # Тестовое число, чтобы продемонстрировать работоспособность алгоритмов"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Алгоритм modified_predict\n",
    "\n",
    "def modified_predict(number:int=1) -> int:\n",
    "    \"\"\"Угадываем число случайным образом с модификацией\n",
    "\n",
    "    Args:\n",
    "        number (int, optional): Загаданное число. Defaults to 1.\n",
    "\n",
    "    Returns:\n",
    "        int: Число попыток\n",
    "    \"\"\"\n",
    "\n",
    "    count = 0\n",
    "    min=1\n",
    "    max=101\n",
    "    \n",
    "    while True:\n",
    "        count += 1\n",
    "        predict_number = np.random.randint(min, max)\n",
    "        \n",
    "        if predict_number > number:\n",
    "            max=predict_number\n",
    "        \n",
    "        if predict_number < number:\n",
    "            min=predict_number+1\n",
    "        \n",
    "        if predict_number == number:\n",
    "            break # выход из цикла, если угадали\n",
    "        \n",
    "    return(count)\n",
    "\n",
    "print(f\"Алгоритм modified_predict угадал число {test_number} за {modified_predict(test_number)} попыток\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Алгоритм mean_predict\n",
    "\n",
    "def mean_predict(number:int=1) -> int: # 2ой метод\n",
    "    \"\"\"Угадываем число методом среднее арифметическое\n",
    "\n",
    "    Args:\n",
    "        number (int, optional): _description_. Defaults to 1.\n",
    "\n",
    "    Returns:\n",
    "        int: Число попыток\n",
    "    \"\"\"\n",
    "    min=1\n",
    "    max=100\n",
    "    count=0\n",
    "    \n",
    "    while True:\n",
    "        count+=1\n",
    "        mean=round((min+max)/2)\n",
    "        \n",
    "        if mean > number:\n",
    "            max=mean\n",
    "        \n",
    "        if mean < number:\n",
    "            min=mean\n",
    "        \n",
    "        if mean == number:\n",
    "            break # выход из цикла, если угадали\n",
    "        \n",
    "        # Костыль\n",
    "        # Во время тестирования было обнаружено, что алгоритм не способен угадать число 1 (из-за округления в высшую сторону)\n",
    "        # Поэтому было написано неэлегантное решение проблемы\n",
    "        if min==1 and max==2: \n",
    "            count+=1\n",
    "            mean=1\n",
    "            if mean == number:\n",
    "                break\n",
    "            \n",
    "    return count\n",
    "\n",
    "print(f\"Алгоритм mean_predict угадал число {test_number} за {mean_predict(test_number)} попыток\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#\n",
    "\n",
    "def random_predict(number:int=1) -> int: # 3ий метод\n",
    "    \"\"\"Рандомно угадываем число\n",
    "\n",
    "    Args:\n",
    "        number (int, optional): Загаданное число. Defaults to 1.\n",
    "\n",
    "    Returns:\n",
    "        int: Число попыток\n",
    "    \"\"\"\n",
    "\n",
    "    count = 0\n",
    "\n",
    "    while True:\n",
    "        count += 1\n",
    "        predict_number = np.random.randint(1, 101) # предполагаемое число\n",
    "        if number == predict_number:\n",
    "            break # выход из цикла, если угадали\n",
    "    return(count)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
